# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters 24.7 GFLOPs
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18] # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
##  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Focus, [ 64, 3 ] ],     # 0-P1/2
    [ -1, 1, DSConv2D, [ 128, 3, 1 ] ],  # 1
    [ -1,1,space_to_depth,[ 1 ] ],   # 2 -P2/4
    [ -1, 3, C3_DSConv, [ 128 ] ],          # 3
    [ -1, 1, DSConv2D, [ 256, 3, 1 ] ],  # 4
    [ -1,1,space_to_depth,[ 1 ] ],   # 5 -P3/8
    [ -1, 6, C3_DSConv, [ 256 ] ],          # 6
    [ -1, 1, DSConv2D, [ 512, 3, 1 ] ],  # 7-P4/16
    [ -1,1,space_to_depth,[ 1 ] ],   # 8 -P4/16
    [ -1, 9, C3_DSConv, [ 512 ] ],          # 9
    [ -1, 1, MHSAPLv31, [ 512, 512 ] ],   # 10      31   33
    [ -1, 1, SPPF, [ 512, 5 ] ],     # 11
  ]


# YOLOv5 v6.0 head   2-3  4-6  8-11 9-12 7-10  11-14
head:
  [[3, 1, DSConv2D, [128, 1, 1]], # 8   11
   [6, 1, DSConv2D, [256, 1, 1]], # 9   12

   [[12, 13], 1, ASFF_2, [128, 0]], # 10   13
   [[12, 13], 1, ASFF_2, [256, 1]], # 11   14

   [11, 1, nn.Upsample, [None, 2, 'nearest']], #12  15
   [[-1, 15], 1, BiFPN_Concat2, [1]], #13   17
   [-1, 1, DSConv2D, [128, 1, 1]], #14     18


   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15  18  19
   [[-1, 14], 1, BiFPN_Concat2, [1]], #16    19    20
   [-1, 1, C3_DSConv, [128, False]],  # 17    20   21
   [18, 1, C3_DSConv, [256, False]],  # 18     21    22

   [11, 1, DSConv2D, [512, 1, 1]], # 19     22    23

   [[21, 22], 1, ASFF_2, [128, 0]], # 20    23   24
   [[21, 22, 23], 1, ASFF_3, [256, 1]], # 21    24   25
   [[22, 23], 1, ASFF_2, [512, 1]], # 22     25    26

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #23   26 ?22     27
   [[-1, 25], 1, BiFPN_Concat2, [1]],  # 24     27    29
   [-1, 1, DSConv2D, [256, 1, 1]], # 25     28    30


   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#26   29    31
   [[-1, 24], 1, BiFPN_Concat2, [1]],  # 27     30  32

   [-1, 1, C3_DSConv, [128, False]], # 28      31   33
   [31, 1, C3_DSConv, [256, False]], # 29      32   34
   [27, 1, C3_DSConv, [512, False]], # 30      33   35



   [[32, 33, 34], 1, Detect, [nc, anchors]]
]